'''
使用函数的时候
def aa(**kwargs):
    pass
'''


def aa(**kwargs):
    print(kwargs)


aa(a=1, b='hello', c='郑义')  # 装包：{'a': 1, 'b': 'hello', 'c': '郑义'}

# 如果在开发的时候，已知有一个字典

dict1 = {'a': 1, 'b': 'hello', 'c': '郑义'}
aa(**dict1)  # 拆包：把字典拆包


def bb(a, b, *c, **d):
    print(a, b, c, d)


bb(1, 2)  # 1 2 () {}
bb(1, 2, 3, 4)  # 1 2 (3,4) {}  因为没有关键字所以，跟’**d‘无关系
bb(1, 2, x=100, y=200)  # 1 2 () {‘x’：100，‘y’：200）
bb(1, 2, 3, x=100)  # 1 2 (3,) {‘x’：100}
# bb(1, 2, x=100, 5, 6)    会报错，因为跳过‘*c’默认往后都是关键字
